bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA32A.xml
            <value-group caption="" name="ENUM_SUT_CKSEL">
                <value caption="Ext. Clock; Start-up time: 6 CK + 0 ms" name="EXTCLK_6CK_0MS" value="0x00"/>
                <value caption="Ext. Clock; Start-up time: 6 CK + 4 ms" name="EXTCLK_6CK_4MS" value="0x10"/>
                <value caption="Ext. Clock; Start-up time: 6 CK + 64 ms" name="EXTCLK_6CK_64MS" value="0x20"/>
                <value caption="Int. RC Osc. 1 MHz; Start-up time: 6 CK + 0 ms" name="INTRCOSC_1MHZ_6CK_0MS"
                       value="0x01"/>
                <value caption="Int. RC Osc. 1 MHz; Start-up time: 6 CK + 4 ms" name="INTRCOSC_1MHZ_6CK_4MS"
                       value="0x11"/>
                <value caption="Int. RC Osc. 1 MHz; Start-up time: 6 CK + 64 ms; default value"
                       name="INTRCOSC_1MHZ_6CK_64MS_DEFAULT" value="0x21"/>
                <value caption="Int. RC Osc. 2 MHz; Start-up time: 6 CK + 0 ms" name="INTRCOSC_2MHZ_6CK_0MS"
                       value="0x02"/>
                <value caption="Int. RC Osc. 2 MHz; Start-up time: 6 CK + 4 ms" name="INTRCOSC_2MHZ_6CK_4MS"
                       value="0x12"/>
                <value caption="Int. RC Osc. 2 MHz; Start-up time: 6 CK + 64 ms" name="INTRCOSC_2MHZ_6CK_64MS"
                       value="0x22"/>
                <value caption="Int. RC Osc. 4 MHz; Start-up time: 6 CK + 0 ms" name="INTRCOSC_4MHZ_6CK_0MS"
                       value="0x03"/>
                <value caption="Int. RC Osc. 4 MHz; Start-up time: 6 CK + 4 ms" name="INTRCOSC_4MHZ_6CK_4MS"
                       value="0x13"/>
                <value caption="Int. RC Osc. 4 MHz; Start-up time: 6 CK + 64 ms" name="INTRCOSC_4MHZ_6CK_64MS"
                       value="0x23"/>
                <value caption="Int. RC Osc. 8 MHz; Start-up time: 6 CK + 0 ms" name="INTRCOSC_8MHZ_6CK_0MS"
                       value="0x04"/>
                <value caption="Int. RC Osc. 8 MHz; Start-up time: 6 CK + 4 ms" name="INTRCOSC_8MHZ_6CK_4MS"
                       value="0x14"/>
                <value caption="Int. RC Osc. 8 MHz; Start-up time: 6 CK + 64 ms" name="INTRCOSC_8MHZ_6CK_64MS"
                       value="0x24"/>
                <value caption="Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 0 ms"
                       name="EXTRCOSC_XX_0MHZ9_18CK_0MS" value="0x05"/>
                <value caption="Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 4 ms"
                       name="EXTRCOSC_XX_0MHZ9_18CK_4MS" value="0x15"/>
                <value caption="Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 64 ms"
                       name="EXTRCOSC_XX_0MHZ9_18CK_64MS" value="0x25"/>
                <value caption="Ext. RC Osc.         -  0.9 MHz; Start-up time: 6 CK + 4 ms"
                       name="EXTRCOSC_XX_0MHZ9_6CK_4MS" value="0x35"/>
                <value caption="Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 0 ms"
                       name="EXTRCOSC_0MHZ9_3MHZ_18CK_0MS" value="0x06"/>
                <value caption="Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 4 ms"
                       name="EXTRCOSC_0MHZ9_3MHZ_18CK_4MS" value="0x16"/>
                <value caption="Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 64 ms"
                       name="EXTRCOSC_0MHZ9_3MHZ_18CK_64MS" value="0x26"/>
                <value caption="Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 6 CK + 4 ms"
                       name="EXTRCOSC_0MHZ9_3MHZ_6CK_4MS" value="0x36"/>
                <value caption="Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 0 ms"
                       name="EXTRCOSC_3MHZ_8MHZ_18CK_0MS" value="0x07"/>
                <value caption="Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 4 ms"
                       name="EXTRCOSC_3MHZ_8MHZ_18CK_4MS" value="0x17"/>
                <value caption="Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 64 ms"
                       name="EXTRCOSC_3MHZ_8MHZ_18CK_64MS" value="0x27"/>
                <value caption="Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 6 CK + 4 ms"
                       name="EXTRCOSC_3MHZ_8MHZ_6CK_4MS" value="0x37"/>
                <value caption="Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 0 ms"
                       name="EXTRCOSC_8MHZ_12MHZ_18CK_0MS" value="0x08"/>
                <value caption="Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 4 ms"
                       name="EXTRCOSC_8MHZ_12MHZ_18CK_4MS" value="0x18"/>
                <value caption="Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 64 ms"
                       name="EXTRCOSC_8MHZ_12MHZ_18CK_64MS" value="0x28"/>
                <value caption="Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 6 CK + 4 ms"
                       name="EXTRCOSC_8MHZ_12MHZ_6CK_4MS" value="0x38"/>
                <value caption="Ext. Low-Freq. Crystal; Start-up time: 1K CK + 4 ms" name="EXTLOFXTAL_1KCK_4MS"
                       value="0x09"/>
                <value caption="Ext. Low-Freq. Crystal; Start-up time: 1K CK + 64 ms" name="EXTLOFXTAL_1KCK_64MS"
                       value="0x19"/>
                <value caption="Ext. Low-Freq. Crystal; Start-up time: 32K CK + 64 ms" name="EXTLOFXTAL_32KCK_64MS"
                       value="0x29"/>
                <value caption="Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 4 ms"
                       name="EXTLOFXTALRES_258CK_4MS" value="0x0A"/>
                <value caption="Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 64 ms"
                       name="EXTLOFXTALRES_258CK_64MS" value="0x1A"/>
                <value caption="Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 0 ms"
                       name="EXTLOFXTALRES_1KCK_0MS" value="0x2A"/>
                <value caption="Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 4 ms"
                       name="EXTLOFXTALRES_1KCK_4MS" value="0x3A"/>
                <value caption="Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 64 ms"
                       name="EXTLOFXTALRES_1KCK_64MS" value="0x0B"/>
                <value caption="Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 0 ms"
                       name="EXTLOFXTALRES_16KCK_0MS" value="0x1B"/>
                <value caption="Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 4 ms"
                       name="EXTLOFXTALRES_16KCK_4MS" value="0x2B"/>
                <value caption="Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 64 ms"
                       name="EXTLOFXTALRES_16KCK_64MS" value="0x3B"/>
                <value caption="Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 4 ms"
                       name="EXTMEDFXTALRES_258CK_4MS" value="0x0C"/>
                <value caption="Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 64 ms"
                       name="EXTMEDFXTALRES_258CK_64MS" value="0x1C"/>
                <value caption="Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 0 ms"
                       name="EXTMEDFXTALRES_1KCK_0MS" value="0x2C"/>
                <value caption="Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 4 ms"
                       name="EXTMEDFXTALRES_1KCK_4MS" value="0x3C"/>
                <value caption="Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 64 ms"
                       name="EXTMEDFXTALRES_1KCK_64MS" value="0x0D"/>
                <value caption="Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 0 ms"
                       name="EXTMEDFXTALRES_16KCK_0MS" value="0x1D"/>
                <value caption="Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 4 ms"
                       name="EXTMEDFXTALRES_16KCK_4MS" value="0x2D"/>
                <value caption="Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 64 ms"
                       name="EXTMEDFXTALRES_16KCK_64MS" value="0x3D"/>
                <value caption="Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 4 ms"
                       name="EXTHIFXTALRES_258CK_4MS" value="0x0E"/>
                <value caption="Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 64 ms"
                       name="EXTHIFXTALRES_258CK_64MS" value="0x1E"/>
                <value caption="Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 0 ms"
                       name="EXTHIFXTALRES_1KCK_0MS" value="0x2E"/>
                <value caption="Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 4 ms"
                       name="EXTHIFXTALRES_1KCK_4MS" value="0x3E"/>
                <value caption="Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 64 ms"
                       name="EXTHIFXTALRES_1KCK_64MS" value="0x0F"/>
                <value caption="Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 0 ms"
                       name="EXTHIFXTALRES_16KCK_0MS" value="0x1F"/>
                <value caption="Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 4 ms"
                       name="EXTHIFXTALRES_16KCK_4MS" value="0x2F"/>
                <value caption="Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 64 ms"
                       name="EXTHIFXTALRES_16KCK_64MS" value="0x3F"/>
            </value-group>
