bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA32A.xml
            <value-group caption="" name="ENUM_BOOTSZ">
                <value caption="Boot Flash size=256 words start address=$3F00" name="256W_3F00" value="0x03"/>
                <value caption="Boot Flash size=512 words start address=$3E00" name="512W_3E00" value="0x02"/>
                <value caption="Boot Flash size=1024 words start address=$3C00" name="1024W_3C00" value="0x01"/>
                <value caption="Boot Flash size=2048 words start address=$3800" name="2048W_3800" value="0x00"/>
            </value-group>
        </module>
        <module caption="Lockbits" name="LOCKBIT">
            <register-group caption="Lockbits" name="LOCKBIT">
                <register caption="" name="LOCKBIT" offset="0x00" size="1" initval="0xFF">
                    <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
                    <bitfield caption="Boot Loader Protection Mode" mask="0x0C" name="BLB0" values="ENUM_BLB"/>
                    <bitfield caption="Boot Loader Protection Mode" mask="0x30" name="BLB1" values="ENUM_BLB2"/>
                </register>
            </register-group>
            <value-group caption="" name="ENUM_LB">
                <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
                <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
                <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
            </value-group>
            <value-group caption="" name="ENUM_BLB">
                <value caption="LPM and SPM prohibited in Application Section" name="LPM_SPM_DISABLE" value="0x00"/>
                <value caption="LPM prohibited in Application Section" name="LPM_DISABLE" value="0x01"/>
                <value caption="SPM prohibited in Application Section" name="SPM_DISABLE" value="0x02"/>
                <value caption="No lock on SPM and LPM in Application Section" name="NO_LOCK" value="0x03"/>
            </value-group>
            <value-group caption="" name="ENUM_BLB2">
                <value caption="LPM and SPM prohibited in Boot Section" name="LPM_SPM_DISABLE" value="0x00"/>
                <value caption="LPM prohibited in Boot Section" name="LPM_DISABLE" value="0x01"/>
                <value caption="SPM prohibited in Boot Section" name="SPM_DISABLE" value="0x02"/>
                <value caption="No lock on SPM and LPM in Boot Section" name="NO_LOCK" value="0x03"/>
            </value-group>
        </module>
        <module caption="EEPROM" name="EEPROM">
            <register-group caption="EEPROM" name="EEPROM">
                <register caption="EEPROM Read/Write Access  Bytes" name="EEAR" offset="0x3E" size="2" mask="0x03FF"/>
                <register caption="EEPROM Data Register" name="EEDR" offset="0x3D" size="1" mask="0xFF"/>
                <register caption="EEPROM Control Register" name="EECR" offset="0x3C" size="1">
                    <bitfield caption="EEPROM Ready Interrupt Enable" mask="0x08" name="EERIE"/>
                    <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMWE"/>
                    <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEWE"/>
                    <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
                </register>
            </register-group>
        </module>
        <module caption="Watchdog Timer" name="WDT">
            <register-group caption="Watchdog Timer" name="WDT">
                <register caption="Watchdog Timer Control Register" name="WDTCR" offset="0x41" size="1">
                    <bitfield caption="RW" mask="0x10" name="WDTOE"/>
                    <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
                    <bitfield caption="Watch Dog Timer Prescaler bits" mask="0x07" name="WDP"
                              values="WDOG_TIMER_PRESCALE_3BITS"/>
                </register>
            </register-group>
            <value-group caption="" name="WDOG_TIMER_PRESCALE_3BITS">
                <value caption="Oscillator Cycles 16K" name="VAL_0x00" value="0x00"/>
                <value caption="Oscillator Cycles 32K" name="VAL_0x01" value="0x01"/>
                <value caption="Oscillator Cycles 64K" name="VAL_0x02" value="0x02"/>
                <value caption="Oscillator Cycles 128K" name="VAL_0x03" value="0x03"/>
                <value caption="Oscillator Cycles 256K" name="VAL_0x04" value="0x04"/>
                <value caption="Oscillator Cycles 512K" name="VAL_0x05" value="0x05"/>
                <value caption="Oscillator Cycles 1024K" name="VAL_0x06" value="0x06"/>
                <value caption="Oscillator Cycles 2048K" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="External Interrupts" name="EXINT">
            <register-group caption="External Interrupts" name="EXINT">
                <register caption="General Interrupt Control Register" name="GICR" offset="0x5B" size="1">
                    <bitfield caption="External Interrupt Request 0 Enable" mask="0x40" name="INT0"/>
                    <bitfield caption="External Interrupt Request 1 Enable" mask="0x80" name="INT1"/>
                    <bitfield caption="External Interrupt Request 2 Enable" mask="0x20" name="INT2"/>
                    <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
                    <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
                </register>
                <register caption="General Interrupt Flag Register" name="GIFR" offset="0x5A" size="1" ocd-rw="R">
                    <bitfield caption="External Interrupt Flags" mask="0xC0" name="INTF"/>
                    <bitfield caption="External Interrupt Flag 2" mask="0x20" name="INTF2"/>
                </register>
                <register caption="General Interrupt Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="Interrupt Sense Control 1 Bits" mask="0x0C" name="ISC1"
                              values="INTERRUPT_SENSE_CONTROL"/>
                    <bitfield caption="Interrupt Sense Control 0 Bits" mask="0x03" name="ISC0"
                              values="INTERRUPT_SENSE_CONTROL"/>
                </register>
