bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA32A.xml
                <register caption="MCU Control And Status Register" name="MCUCSR" offset="0x54" size="1">
                    <bitfield caption="Interrupt Sense Control 2" mask="0x40" name="ISC2"/>
                </register>
            </register-group>
            <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
                <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
                <value caption="Any Logical Change of INTX" name="VAL_0x01" value="0x01"/>
                <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
                <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 8-bit" name="TC8">
            <register-group caption="Timer/Counter, 8-bit" name="TC0">
                <register caption="Timer/Counter Control Register" name="TCCR0" offset="0x53" size="1">
                    <bitfield caption="Force Output Compare" mask="0x80" name="FOC0"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x40" name="WGM00" values="WAVEFORM_GEN_MODE"/>
                    <bitfield caption="Compare Match Output Modes" mask="0x30" name="COM0"/>
                    <bitfield caption="Waveform Generation Mode 1" mask="0x08" name="WGM01"/>
                    <bitfield caption="Clock Selects" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter Register" name="TCNT0" offset="0x52" size="1" mask="0xFF"/>
                <register caption="Output Compare Register" name="OCR0" offset="0x5C" size="1" mask="0xFF"/>
                <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK" offset="0x59" size="1">
                    <bitfield caption="Timer/Counter0 Output Compare Match Interrupt register" mask="0x02"
                              name="OCIE0"/>
                    <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x01" name="TOIE0"/>
                </register>
                <register caption="Timer/Counter Interrupt Flag register" name="TIFR" offset="0x58" size="1" ocd-rw="R">
                    <bitfield caption="Output Compare Flag 0" mask="0x02" name="OCF0"/>
                    <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x01" name="TOV0"/>
                </register>
            </register-group>
            <value-group caption="" name="WAVEFORM_GEN_MODE">
                <value caption="Normal" name="VAL_0x00" value="0x00"/>
                <value caption="PWM, Phase Correct" name="VAL_0x02" value="0x02"/>
                <value caption="CTC" name="VAL_0x01" value="0x01"/>
                <value caption="Fast PWM" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 8-bit Async" name="TC8_ASYNC">
            <register-group caption="Timer/Counter, 8-bit Async" name="TC2">
                <register caption="Timer/Counter Interrupt Mask register" name="TIMSK" offset="0x59" size="1">
                    <bitfield caption="Timer/Counter2 Output Compare Match Interrupt Enable" mask="0x80" name="OCIE2"/>
                    <bitfield caption="Timer/Counter2 Overflow Interrupt Enable" mask="0x40" name="TOIE2"/>
                </register>
                <register caption="Timer/Counter Interrupt Flag Register" name="TIFR" offset="0x58" size="1" ocd-rw="R">
                    <bitfield caption="Output Compare Flag 2" mask="0x80" name="OCF2"/>
                    <bitfield caption="Timer/Counter2 Overflow Flag" mask="0x40" name="TOV2"/>
                </register>
                <register caption="Timer/Counter2 Control Register" name="TCCR2" offset="0x45" size="1">
                    <bitfield caption="Force Output Compare" mask="0x80" name="FOC2"/>
                    <bitfield caption="Pulse Width Modulator Enable" mask="0x40" name="WGM20"/>
                    <bitfield caption="Compare Output Mode bits" mask="0x30" name="COM2"/>
                    <bitfield caption="Clear Timer/Counter2 on Compare Match" mask="0x08" name="WGM21"/>
                    <bitfield caption="Clock Select bits" mask="0x07" name="CS2" values="CLK_SEL_3BIT"/>
                </register>
                <register caption="Timer/Counter2" name="TCNT2" offset="0x44" size="1" mask="0xFF"/>
                <register caption="Timer/Counter2 Output Compare Register" name="OCR2" offset="0x43" size="1"
                          mask="0xFF"/>
                <register caption="Asynchronous Status Register" name="ASSR" offset="0x42" size="1">
                    <bitfield caption="Asynchronous Timer/counter2" mask="0x08" name="AS2"/>
                    <bitfield caption="Timer/Counter2 Update Busy" mask="0x04" name="TCN2UB"/>
                    <bitfield caption="Output Compare Register2 Update Busy" mask="0x02" name="OCR2UB"/>
                    <bitfield caption="Timer/counter Control Register2 Update Busy" mask="0x01" name="TCR2UB"/>
                </register>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/32" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/64" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/128" name="VAL_0x05" value="0x05"/>
                <value caption="Running, CLK/256" name="VAL_0x06" value="0x06"/>
                <value caption="Running, CLK/1024" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 16-bit" name="TC16">
            <register-group caption="Timer/Counter, 16-bit" name="TC1">
                <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK" offset="0x59" size="1">
                    <bitfield caption="Timer/Counter1 Input Capture Interrupt Enable" mask="0x20" name="TICIE1"/>
                    <bitfield caption="Timer/Counter1 Output CompareA Match Interrupt Enable" mask="0x10"
                              name="OCIE1A"/>
                    <bitfield caption="Timer/Counter1 Output CompareB Match Interrupt Enable" mask="0x08"
                              name="OCIE1B"/>
                    <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x04" name="TOIE1"/>
                </register>
