bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA32A.xml
                <register caption="Timer/Counter Interrupt Flag register" name="TIFR" offset="0x58" size="1" ocd-rw="R">
                    <bitfield caption="Input Capture Flag 1" mask="0x20" name="ICF1"/>
                    <bitfield caption="Output Compare Flag 1A" mask="0x10" name="OCF1A"/>
                    <bitfield caption="Output Compare Flag 1B" mask="0x08" name="OCF1B"/>
                    <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x04" name="TOV1"/>
                </register>
                <register caption="Timer/Counter1 Control Register A" name="TCCR1A" offset="0x4F" size="1">
                    <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM1A"/>
                    <bitfield caption="Compare Output Mode 1B, bits" mask="0x30" name="COM1B"/>
                    <bitfield caption="Force Output Compare 1A" mask="0x08" name="FOC1A"/>
                    <bitfield caption="Force Output Compare 1B" mask="0x04" name="FOC1B"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM1"/>
                </register>
                <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x4E" size="1">
                    <bitfield caption="Input Capture 1 Noise Canceler" mask="0x80" name="ICNC1"/>
                    <bitfield caption="Input Capture 1 Edge Select" mask="0x40" name="ICES1"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM1" lsb="2"/>
                    <bitfield caption="Prescaler source of Timer/Counter 1" mask="0x07" name="CS1"
                              values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter1  Bytes" name="TCNT1" offset="0x4C" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter1 Output Compare Register  Bytes" name="OCR1A" offset="0x4A" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter1 Output Compare Register  Bytes" name="OCR1B" offset="0x48" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter1 Input Capture Register  Bytes" name="ICR1" offset="0x46" size="2"
                          mask="0xFFFF"/>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Serial Peripheral Interface" name="SPI">
            <register-group caption="Serial Peripheral Interface" name="SPI">
                <register caption="SPI Data Register" name="SPDR" offset="0x2F" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="SPI Status Register" name="SPSR" offset="0x2E" size="1" ocd-rw="R">
                    <bitfield caption="SPI Interrupt Flag" mask="0x80" name="SPIF"/>
                    <bitfield caption="Write Collision Flag" mask="0x40" name="WCOL"/>
                    <bitfield caption="Double SPI Speed Bit" mask="0x01" name="SPI2X"/>
                </register>
                <register caption="SPI Control Register" name="SPCR" offset="0x2D" size="1">
                    <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE"/>
                    <bitfield caption="SPI Enable" mask="0x40" name="SPE"/>
                    <bitfield caption="Data Order" mask="0x20" name="DORD"/>
                    <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR"/>
                    <bitfield caption="Clock polarity" mask="0x08" name="CPOL"/>
                    <bitfield caption="Clock Phase" mask="0x04" name="CPHA"/>
                    <bitfield caption="SPI Clock Rate Selects" mask="0x03" name="SPR" values="COMM_SCK_RATE_3BIT"/>
                </register>
            </register-group>
            <value-group caption="" name="COMM_SCK_RATE_3BIT">
                <value caption="fosc/4" name="VAL_0x00" value="0x00"/>
                <value caption="fosc/16" name="VAL_0x01" value="0x01"/>
                <value caption="fosc/64" name="VAL_0x02" value="0x02"/>
                <value caption="fosc/128" name="VAL_0x03" value="0x03"/>
                <value caption="fosc/2" name="VAL_0x04" value="0x04"/>
                <value caption="fosc/8" name="VAL_0x05" value="0x05"/>
                <value caption="fosc/32" name="VAL_0x06" value="0x06"/>
                <value caption="fosc/64" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="USART" name="USART">
            <register-group caption="USART" name="USART">
                <register caption="USART I/O Data Register" name="UDR" offset="0x2C" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="USART Control and Status Register A" name="UCSRA" offset="0x2B" size="1" ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC"/>
                    <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE"/>
                    <bitfield caption="Framing Error" mask="0x10" name="FE"/>
                    <bitfield caption="Data overRun" mask="0x08" name="DOR"/>
                    <bitfield caption="Parity Error" mask="0x04" name="UPE"/>
                    <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X"/>
                    <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM"/>
                </register>
                <register caption="USART Control and Status Register B" name="UCSRB" offset="0x2A" size="1">
                    <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE"/>
                    <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE"/>
                    <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE"/>
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN"/>
                    <bitfield caption="Character Size" mask="0x04" name="UCSZ2"/>
                    <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB8"/>
                    <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB8"/>
                </register>
                <register caption="USART Control and Status Register C" name="UCSRC" offset="0x40" size="1" ocd-rw="">
                    <bitfield caption="Register Select" mask="0x80" name="URSEL"/>
                    <bitfield caption="USART Mode Select" mask="0x40" name="UMSEL" values="COMM_USART_MODE"/>
                    <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM" values="COMM_UPM_PARITY_MODE"/>
                    <bitfield caption="Stop Bit Select" mask="0x08" name="USBS" values="COMM_STOP_BIT_SEL"/>
                    <bitfield caption="Character Size" mask="0x06" name="UCSZ"/>
                    <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL"/>
                </register>
                <register caption="USART Baud Rate Register Hight Byte" name="UBRRH" offset="0x40" size="1"
                          mask="0x0F"/>
                <register caption="USART Baud Rate Register Low Byte" name="UBRRL" offset="0x29" size="1" mask="0xFF"/>
            </register-group>
