bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA32A.xml
            <value-group caption="" name="COMM_USART_MODE">
                <value caption="Asynchronous Operation" name="VAL_0x00" value="0x00"/>
                <value caption="Synchronous Operation" name="VAL_0x01" value="0x01"/>
            </value-group>
            <value-group caption="" name="COMM_UPM_PARITY_MODE">
                <value caption="Disabled" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Enabled, Even Parity" name="VAL_0x02" value="0x02"/>
                <value caption="Enabled, Odd Parity" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="COMM_STOP_BIT_SEL">
                <value caption="1-bit" name="VAL_0x00" value="0x00"/>
                <value caption="2-bit" name="VAL_0x01" value="0x01"/>
            </value-group>
        </module>
        <module caption="Analog Comparator" name="AC">
            <register-group caption="Analog Comparator" name="AC">
                <register caption="Special Function IO Register" name="SFIOR" offset="0x50" size="1">
                    <bitfield caption="ADC Auto Trigger Source" mask="0xE0" name="ADTS"/>
                    <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x08" name="ACME"/>
                    <bitfield caption="Pull-up disable" mask="0x04" name="PUD"/>
                    <bitfield caption="Prescaler Reset Timer/Counter2" mask="0x02" name="PSR2"/>
                    <bitfield caption="Prescaler Reset Timer/Counter1 and Timer/Counter0" mask="0x01" name="PSR10"/>
                </register>
                <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x28" size="1"
                          ocd-rw="R">
                    <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
                    <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
                    <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
                    <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
                    <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
                    <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
                    <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS"
                              values="ANALOG_COMP_INTERRUPT"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_COMP_INTERRUPT">
                <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
                <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="Analog-to-Digital Converter" name="ADC">
            <register-group caption="Analog-to-Digital Converter" name="ADC">
                <register caption="The ADC multiplexer Selection Register" name="ADMUX" offset="0x27" size="1">
                    <bitfield caption="Reference Selection Bits" mask="0xC0" name="REFS" values="ANALOG_ADC_V_REF2"/>
                    <bitfield caption="Left Adjust Result" mask="0x20" name="ADLAR"/>
                    <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x1F" name="MUX"/>
                </register>
                <register caption="The ADC Control and Status register" name="ADCSRA" offset="0x26" size="1" ocd-rw="R">
                    <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
                    <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
                    <bitfield caption="ADC Auto Trigger" mask="0x20" name="ADATE"/>
                    <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
                    <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
                    <bitfield caption="ADC Prescaler Select Bits" mask="0x07" name="ADPS"
                              values="ANALOG_ADC_PRESCALER"/>
                </register>
                <register caption="ADC Data Register  Bytes" name="ADC" offset="0x24" size="2" mask="0xFFFF"/>
                <register caption="Special Function IO Register" name="SFIOR" offset="0x50" size="1">
                    <bitfield caption="ADC Auto Trigger Sources" mask="0xE0" name="ADTS"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_ADC_V_REF2">
                <value caption="AREF, Internal Vref turned off" name="VAL_0x00" value="0x00"/>
                <value caption="AVCC with external capacitor at AREF pin" name="VAL_0x01" value="0x01"/>
                <value caption="Reserved" name="VAL_0x02" value="0x02"/>
                <value caption="Internal 2.56V Voltage Reference with external capacitor at AREF pin" name="VAL_0x03"
                       value="0x03"/>
            </value-group>
            <value-group caption="" name="ANALOG_ADC_PRESCALER">
                <value caption="2" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="I/O Port" name="PORT">
            <register-group caption="I/O Port" name="PORTA">
                <register caption="Port A Data Register" name="PORTA" offset="0x3B" size="1" mask="0xFF"/>
                <register caption="Port A Data Direction Register" name="DDRA" offset="0x3A" size="1" mask="0xFF"/>
                <register caption="Port A Input Pins" name="PINA" offset="0x39" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
