bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA32A.xml
            <register-group caption="I/O Port" name="PORTB">
                <register caption="Port B Data Register" name="PORTB" offset="0x38" size="1" mask="0xFF"/>
                <register caption="Port B Data Direction Register" name="DDRB" offset="0x37" size="1" mask="0xFF"/>
                <register caption="Port B Input Pins" name="PINB" offset="0x36" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTC">
                <register caption="Port C Data Register" name="PORTC" offset="0x35" size="1" mask="0xFF"/>
                <register caption="Port C Data Direction Register" name="DDRC" offset="0x34" size="1" mask="0xFF"/>
                <register caption="Port C Input Pins" name="PINC" offset="0x33" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTD">
                <register caption="Port D Data Register" name="PORTD" offset="0x32" size="1" mask="0xFF"/>
                <register caption="Port D Data Direction Register" name="DDRD" offset="0x31" size="1" mask="0xFF"/>
                <register caption="Port D Input Pins" name="PIND" offset="0x30" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
        </module>
        <module caption="CPU Registers" name="CPU">
            <register-group caption="CPU Registers" name="CPU">
                <register caption="Status Register" name="SREG" offset="0x5F" size="1">
                    <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
                    <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
                    <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
                    <bitfield caption="Sign Bit" mask="0x10" name="S"/>
                    <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
                    <bitfield caption="Negative Flag" mask="0x04" name="N"/>
                    <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
                    <bitfield caption="Carry Flag" mask="0x01" name="C"/>
                </register>
                <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0x0FFF"/>
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="Sleep Enable" mask="0x80" name="SE"/>
                    <bitfield caption="Sleep Mode Select" mask="0x70" name="SM" values="CPU_SLEEP_MODE_3BITS"/>
                    <bitfield caption="Interrupt Sense Control 1 Bits" mask="0x0C" name="ISC1"
                              values="INTERRUPT_SENSE_CONTROL2"/>
                    <bitfield caption="Interrupt Sense Control 0 Bits" mask="0x03" name="ISC0"
                              values="INTERRUPT_SENSE_CONTROL2"/>
                </register>
                <register caption="MCU Control And Status Register" name="MCUCSR" offset="0x54" size="1">
                    <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
                    <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
                    <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
                    <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
                    <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
                    <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
                </register>
                <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x51" size="1" mask="0xFF">
                    <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
                </register>
                <register caption="Special Function IO Register" name="SFIOR" offset="0x50" size="1" mask="0x07"/>
            </register-group>
            <value-group caption="" name="CPU_SLEEP_MODE_3BITS">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
                <value caption="Power Down" name="PDOWN" value="0x02"/>
                <value caption="Power Save" name="PSAVE" value="0x03"/>
                <value caption="Reserved" name="VAL_0x04" value="0x04"/>
                <value caption="Reserved" name="VAL_0x05" value="0x05"/>
                <value caption="Standby" name="STDBY" value="0x06"/>
                <value caption="Extended Standby" name="ESTDBY" value="0x07"/>
            </value-group>
            <value-group caption="" name="INTERRUPT_SENSE_CONTROL2">
                <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
                <value caption="Any Logical Change in INTX" name="VAL_0x01" value="0x01"/>
                <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
                <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="1.0 MHz" name="1_0_MHz"/>
                <value value="0x01" caption="2.0 MHz" name="2_0_MHz"/>
                <value value="0x02" caption="4.0 MHz" name="4_0_MHz"/>
                <value value="0x03" caption="8.0 MHz" name="8_0_MHz"/>
            </value-group>

        </module>
        <module caption="Bootloader" name="BOOT_LOAD">
            <register-group caption="Bootloader" name="BOOT_LOAD">
                <register caption="Store Program Memory Control Register" name="SPMCR" offset="0x57" size="1">
                    <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
                    <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
                    <bitfield caption="Read While Write secion read enable" mask="0x10" name="RWWSRE"/>
                    <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
                    <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
                    <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
                    <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
                </register>
            </register-group>
        </module>
        <module caption="Two Wire Serial Interface" name="TWI">
            <register-group caption="Two Wire Serial Interface" name="TWI">
                <register caption="TWI Bit Rate register" name="TWBR" offset="0x20" size="1" mask="0xFF"/>
                <register caption="TWI Control Register" name="TWCR" offset="0x56" size="1" ocd-rw="R">
                    <bitfield caption="TWI Interrupt Flag" mask="0x80" name="TWINT"/>
                    <bitfield caption="TWI Enable Acknowledge Bit" mask="0x40" name="TWEA"/>
                    <bitfield caption="TWI Start Condition Bit" mask="0x20" name="TWSTA"/>
                    <bitfield caption="TWI Stop Condition Bit" mask="0x10" name="TWSTO"/>
                    <bitfield caption="TWI Write Collition Flag" mask="0x08" name="TWWC"/>
                    <bitfield caption="TWI Enable Bit" mask="0x04" name="TWEN"/>
                    <bitfield caption="TWI Interrupt Enable" mask="0x01" name="TWIE"/>
                </register>
